Функция ПолучитьПрефиксНомера() Экспорт
	Возврат Константы.ПрефиксНумерации.Получить();
КонецФункции 



Процедура ЧтениеXMLНаСервереЧасть2(Чтение)
	
	//прочитаем начало xml файла
    Чтение.ПерейтиКСодержимому();
    
    //прочитаем начало корневого элемента
    Чтение.Прочитать();
    
    //читаем содержимое пока текущим не станет конец корневого элемента, т.к. мы писали туда только целые элементы справочника,
    //а сериализатор читает каждый из их полностью, то мы упремся именно в конец корневого
    Пока Чтение.ТипУзла<>ТипУзлаXML.КонецЭлемента Цикл
        
        //читаем очередной элемент справочника
        Объект = СериализаторXDTO.ПрочитатьXML(Чтение);
        //покажем что прочитали, осталось только записать объект
        Сообщить(""+ТипЗнч(Объект)+" - "+Объект);
		Объект.Записать(РежимЗаписиДокумента.Проведение);
    КонецЦикла;
    
    Чтение.Закрыть();

КонецПроцедуры