Функция ПолучитьПрефиксНомера() Экспорт
	Возврат Константы.ПрефиксНумерации.Получить();
КонецФункции 



Процедура ЧтениеXMLНаСервере(ЧтениеXML)
	
	Документ = Документы.ПоступлениеТоваров.СоздатьДокумент();  ///НОВЫЙ ДОКУМЕНТ
	Товары =  Документ.Товары; 									///ТАБЛИЧНАЯ ЧАСТЬ "Товары"
	
	Пока ЧтениеXML.Прочитать() Цикл  //Цикл по структуре
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда  //Определяем начало элемента
			Если ЧтениеXML.Имя = "ПоступлениеТоваров" Тогда
				Документ.Код 			= ЧтениеXML.ЗначениеАтрибута("Код");
				Документ.Дата 			= Дата(ЧтениеXML.ЗначениеАтрибута("Дата")); ///Преобразовываем обратно в дату
				Документ.Номер 			= ЧтениеXML.ЗначениеАтрибута("Номер");
				Документ.Ответственный 	= Справочники.Пользователи.НайтиПоНаименованию(ЧтениеXML.ЗначениеАтрибута("Ответственный"));
				Документ.Комментарии 	= ЧтениеXML.ЗначениеАтрибута("Комментарии");
				Документ.Склад 			= Справочники.Склады.НайтиПоНаименованию(ЧтениеXML.ЗначениеАтрибута("Склад"));
			КонецЕсли;
			Если ЧтениеXML.Имя = "ТаблицаТовары" Тогда   ///Чтение элемента  "ТаблицаТовары"
				НоваяСтрока = Товары.Добавить();
				НоваяСтрока.Номенклатура       = Справочники.Пользователи.НайтиПоНаименованию(ЧтениеXML.ЗначениеАтрибута("Номенклатура"));			
				НоваяСтрока.Количество         = Число(ЧтениеXML.ЗначениеАтрибута("Количество"));
				НоваяСтрока.Цена               = Число(ЧтениеXML.ЗначениеАтрибута("Цена"));
				НоваяСтрока.Сумма              = Число(ЧтениеXML.ЗначениеАтрибута("Сумма"));
				НоваяСтрока.ЕД                 = НоваяСтрока.Номенклатура.ЕденицаИзмерения;
			КонецЕсли;
		КонецЕсли ;
	КонецЦикла;
	
	Документ.Записать(РежимЗаписиДокумента.Проведение);	

КонецПроцедуры